app/controllers/school_classes_controller.rb

  def create
    @school_class= SchoolClass.new(title: params["school_class"]["title"], room_number: params["school_class"]["room_number"])
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-03-02 22:42:55.270647"], ["updated_at", "2017-03-02 22:42:55.270647"]]

  def update
  @school_class = SchoolClass.find(params[:id])
  @school_class.update(title: params["school_class"]["title"], room_number: params["school_class"]["room_number"])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2017-03-02 21:35:38.457222"], ["id", 1]]