app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-03-02 22:30:42.839554"], ["updated_at", "2017-03-02 22:30:42.839554"]]
---
  def create
  @student = Student.new(first_name: params["student"]["first_name"], last_name: params["student"]["last_name"])
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2017-03-02 21:35:38.566072"], ["id", 1]]
---
  def update
  @student = Student.find(params[:id])
  @student.update(first_name: params["student"]["first_name"], last_name: params["student"]["last_name"])